---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCOpeningData.Dispose
source: html/5e7ce769-ad7b-7bd9-718b-cc12c4dfb2c0.htm
---
# Autodesk.Revit.DB.IFC.IFCOpeningData.Dispose Method

Releases all resources used by the IFCOpeningData

## Syntax (C#)
```csharp
public void Dispose()
```